using DataStructure;
using System;
using System.Collections;
using System.Collections.Generic;
using System.Diagnostics;
using System.Runtime.CompilerServices;

public class Program
{
    public static void Main()
    {
        //Если скобки в s расставлены правильно, выведите
        //строку “Success". В противном случае выведите индекс (используя индексацию с единицы) первой закрывающей скобки, для
        //которой нет соответствующей открывающей. Если такой нет,
        //выведите индекс первой открывающей скобки, для которой нет
        //соответствующей закрывающей.

        //Входные данные для Stepik
        //string input = string.Empty;
        //input = Console.ReadLine();
        //int count = IsBalanced(input);
        //Console.WriteLine(count == 0 ? "Sucusses" : count);
    }

}

